12/data/attachments/a0cf55f7596c8d14.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9ce3a6ad-9246-4407-b9d1-aa9353a348ec</nif:username>
            <nif:friendToBeAdded>Marcus_woman_Actions_85990_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>